src/object-diagram/logic/test-suites/primitive-array-types/tests/object/writer/expected.puml
@startuml
map "[StackFrame]" as _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 <<[StackFrame]>> {
  fieldContainer =>
}
map "PrimitiveArrayTypesDemo$FieldContainer@27 <U+0022>FieldContainer[booleans=[Z@355da254, bytes=[B@4dc63996, chars=[C@d716361, shorts=[S@6ff3c5b5, ints=[I@3764951d, longs=[J@4b1210ee, floats=[F@4d7e1886, doubles=[D@3cd1a2f1]<U+0022>" as _0f7c198c39679a29377285861c0eab7b301f672d <<PrimitiveArrayTypesDemo$FieldContainer>> {
  booleans =>
  bytes =>
  chars =>
  doubles =>
  floats =>
  ints =>
  longs =>
  shorts =>
}
object "boolean[1]@9" as _b154bfeb1a9320d40888ff4cdef84d83c4a0763e <<boolean[]>> {
  [false]
}
object "byte[1]@10" as _dd7b1158113ccb66341b847e268104fd10a73f08 <<byte[]>> {
  [0]
}
object "char[1]@11" as _107a7f5ab9da095e7ebc472daf37a4b638129ed8 <<char[]>> {
  [\u0000]
}
object "double[1]@16" as _8aab52297f8c7f19a95f5ce7a264c03b1cea2d1e <<double[]>> {
  [0.000000]
}
object "float[1]@15" as _a2d4f1721001eb4a4a134b6572cef2f2015c2280 <<float[]>> {
  [0.000000]
}
object "int[1]@13" as _b44837f8cf9531d95542f988ac73cd2a7cfe6bc2 <<int[]>> {
  [0]
}
object "long[1]@14" as _fcfd466207315f120afc973f533b6ed01d5330bc <<long[]>> {
  [0]
}
object "short[1]@12" as _fad48851f910c6ef0f8c63d5e047b6288c977977 <<short[]>> {
  [0]
}
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::fieldContainer => _0f7c198c39679a29377285861c0eab7b301f672d : fieldContainer
_0f7c198c39679a29377285861c0eab7b301f672d::booleans => _b154bfeb1a9320d40888ff4cdef84d83c4a0763e : booleans
_0f7c198c39679a29377285861c0eab7b301f672d::bytes => _dd7b1158113ccb66341b847e268104fd10a73f08 : bytes
_0f7c198c39679a29377285861c0eab7b301f672d::chars => _107a7f5ab9da095e7ebc472daf37a4b638129ed8 : chars
_0f7c198c39679a29377285861c0eab7b301f672d::doubles => _8aab52297f8c7f19a95f5ce7a264c03b1cea2d1e : doubles
_0f7c198c39679a29377285861c0eab7b301f672d::floats => _a2d4f1721001eb4a4a134b6572cef2f2015c2280 : floats
_0f7c198c39679a29377285861c0eab7b301f672d::ints => _b44837f8cf9531d95542f988ac73cd2a7cfe6bc2 : ints
_0f7c198c39679a29377285861c0eab7b301f672d::longs => _fcfd466207315f120afc973f533b6ed01d5330bc : longs
_0f7c198c39679a29377285861c0eab7b301f672d::shorts => _fad48851f910c6ef0f8c63d5e047b6288c977977 : shorts
@enduml
